<div style="color:white;
           display:fill;
           border-radius:5px;
           background-color:#5642C5;
           font-size:200%;
           font-family:Arial;letter-spacing:0.5px">

<p width = 20%, style="padding: 10px;
              color:white;">
SQL: Introduction and Basic Querying
</p>
</div>

Data Science Cohort Live NYC Sept 2022
<p>Phase 1: Topic 6</p>
<br>
<br>

<div align = "right">
<img src="Images/flatiron-school-logo.png" align = "right" width="200"/>
</div>

#### Databases

Data for organizations: typically stored in a **database**.

- Database: organized collection of structured information.
- Typically fairly large and hosted by dedicated servers.
- A database controlled by a database management system (DBMS).

<div align = "center">
    <center><img src="Images/dbms.jpg" align = "center" width="500"/></center>
</div>

With DBMS: store, update, share, and access specific subset of database. 

- CSVs and JSONs are often extracts of some data from a database.

#### The relational database
<br>
<div align = "center">
    <center><img src="Images/tables_relational.png" align = "center" width="700"/></center>
</div>

Tables are linked together by relationships.

  Why relational databases are great and what came before (first 5 modules): <br>
  https://mariadb.com/kb/en/database-theory/

Common DBMS for Relational Databases
<br>
<div>
    <center><img src="Images/postgresql.png"  width="200"/></center>
    <center><img src="Images/mysql.png"  width="300"/></center>
    <center><img src="Images/SQLite-Python.jpg" align = "center" width="200"/></center>
</div>
      
</div>

#### Structured Query Language

- De-facto king of languages for interacting with relational databases and their DBMS.
- Invaluable for you in almost any data role. 
- You will use it often to get the data that you need for your analyses.

Let's get into using SQL!

In [32]:
# import sqlite
import sqlite3
import pandas as pd

class PandaSql:
    def __init__(self, db_link):
        self.conn = sqlite3.Connection(db_link)
    
    def sel(self, table, col_names, cond=None, group=None, having=None, order=None, limit=None):
        s_func = f"SELECT {col_names}\nFROM {table}"
        ending = ""
        if cond != None:
            ending = "\nWHERE " + cond
        if group != None:
            ending += "\nGROUP BY " + group
        if having != None:
            ending += "\nHAVING " + having
        if order != None:
            ending += "\nORDER BY " + order
        if limit != None:
            ending += "\nLIMIT " + limit
        ending += ";"
        query = s_func + ending
        return pd.read_sql(query, self.conn)

Interacting with a sqlite database.
- Connect to database 
- Create interface to ask database for stuff
- After connection established:
    1. Execute query 
    2. Fetch result 
- Close connection to database when done with queries.

Commands:
- conn = sqlite3.connect(database)
- cursor_obj = connection.cursor()
- Query database/get result:
    1. cursor.execute(SQL_query)
    2. cursor.fetchall()
- connection.close()

This opens a connection to the flights database and creates cursor object.

In [33]:
con = sqlite3.connect('data/flights.db')
cursor_obj = con.cursor()
sqlme = PandaSql('data/flights.db')

See tables in the sqlite database via command line.

In [3]:
%%bash 

sqlite3 data/flights.db
.tables

Couldn't find program: 'bash'

Get schema of sqlite database: whole or single table

In [ ]:
%%bash
sqlite3 data/flights.db
.schema airports

#### SELECT statement

Let's explore the following clauses and structure:

```sql
SELECT columns ( * for all fields)
FROM table
WHERE condition
ORDER BY columns
LIMIT number (limits to first n entries of table)
```

#### Example

Use the cursor object to execute and retrieve the results of the following query:

Retrieve all fields for the first five entries of the database.

In [4]:
# EXECUTE THAT QUERY

query = cursor_obj.execute("""
SELECT *
FROM airports
LIMIT 5
""")

In [5]:
# FETCH THE RESULTS

query.fetchall()

[(0,
  '1',
  'Goroka',
  'Goroka',
  'Papua New Guinea',
  'GKA',
  'AYGA',
  '-6.081689',
  '145.391881',
  '5282',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (1,
  '2',
  'Madang',
  'Madang',
  'Papua New Guinea',
  'MAG',
  'AYMD',
  '-5.207083',
  '145.7887',
  '20',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (2,
  '3',
  'Mount Hagen',
  'Mount Hagen',
  'Papua New Guinea',
  'HGU',
  'AYMH',
  '-5.826789',
  '144.295861',
  '5388',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (3,
  '4',
  'Nadzab',
  'Nadzab',
  'Papua New Guinea',
  'LAE',
  'AYNZ',
  '-6.569828',
  '146.726242',
  '239',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (4,
  '5',
  'Port Moresby Jacksons Intl',
  'Port Moresby',
  'Papua New Guinea',
  'POM',
  'AYPY',
  '-9.443383',
  '147.22005',
  '146',
  '10',
  'U',
  'Pacific/Port_Moresby')]

- execute, fetchall protocol gets data in python list form.
- can issue commands to create things in database.

Now close the connection to the database when you are done.

In [6]:
con.close()
con

When *just retrieving* tabular data:

- Pandas has pd.read_sql(query, database_connection) command.

In [7]:
airports_query = \
"""
SELECT *
FROM airports
"""

Make sure you have a connection to the sql database open.

In [8]:
con = sqlite3.connect('data/flights.db')

In [9]:
# requires reference to open database connection
query_result_df = pd.read_sql(airports_query, con)
query_result_df.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

Selecting particular columns:

In [10]:
query_result_df = pd.read_sql("""

SELECT city, country 
FROM airports

""", con)

query_result_df.head(5)

           city           country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

#### DISTINCT
- Select only unique results of query.

In [11]:
query_result = pd.read_sql("""

SELECT DISTINCT country
FROM airports

""", con)

query_result.head()

            country
0  Papua New Guinea
1         Greenland
2           Iceland
3            Canada
4           Algeria

**Example**

Get a list of the distinct cities in the database and store it as a pandas Series. What is the number of cities represented in this database?

In [12]:
query_result = pd.read_sql("""

SELECT DISTINCT city
FROM airports

""", con)
   
query_result.head()

           city
0        Goroka
1        Madang
2   Mount Hagen
3        Nadzab
4  Port Moresby

In [13]:
query_series = query_result['city']

In [14]:
query_series.shape

(6977,)

**Example**

Get the cities for each airport in the database and store it as a pandas Series. 

Then get me the number of airports in each city and the number of unique cities. You can use Pandas functions for this.

In [15]:
cities = pd.read_sql("""
SELECT city, name
FROM airports

""", con)

cities["city"].value_counts()

London         21
New York       13
Hong Kong      12
Berlin         10
Paris          10
               ..
Woodbourne      1
Oaxaca          1
Siguanea        1
Line            1
Dienbienphu     1
Name: city, Length: 6977, dtype: int64

#### AS modifier

`AS`: renaming a column in the query and returned result.

In [16]:
sql_query = pd.read_sql("""

SELECT city AS Airport_City, 
       country AS "Airport Country"
FROM airports

""", con)

sql_query.head()

   Airport_City   Airport Country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

Some SQL dialects do not require the AS statement:

In [17]:
sql_query = pd.read_sql("""

SELECT city "Airport City", 
       country "Airport Country"
FROM airports

""", con)

sql_query.head()

   Airport City   Airport Country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

#### Functions
Can use predefined functions in SELECT statements:
<br>
<br>
SELECT FUNCTION(columns)
<br>
FROM table

Applies function to the each column and spits out new table.

Functions can be: 
- Transformations on columns:
    - Convert each element in a string column to upper case.
- Aggregation:
    - statistic on each field in a table 
    - e.g. max, min, mean, sum, etc.

#### Transformation

In [18]:
sql_query_df = pd.read_sql("""

SELECT UPPER(name) AS "AIRPORT NAMES IN CAPS",
       LENGTH(name) AS "Airport Name Length"
       
FROM airports

""", con)

sql_query_df.head()

        AIRPORT NAMES IN CAPS  Airport Name Length
0                      GOROKA                    6
1                      MADANG                    6
2                 MOUNT HAGEN                   11
3                      NADZAB                    6
4  PORT MORESBY JACKSONS INTL                   26

#### Aggregation
- MAX()
- MIN()
- SUM()
- AVG()
- COUNT()

Get count of entries in table:

In [21]:
sql_query_df = pd.read_sql("""

SELECT COUNT(*) AS count
FROM airports


""", con)

sql_query_df

   count
0   8107

Get count of non-missing entries in a given field:


SELECT COUNT(field_name)
FROM table

In [22]:
sql_query_df = pd.read_sql("""

SELECT COUNT(code) as code_count
FROM airports



""", con)

sql_query_df

   code_count
0        5880

Distinct countries in country field of airports table:

In [23]:
sql_query_df = pd.read_sql("""

SELECT COUNT(DISTINCT country) as country_count
FROM airports


""", con)

sql_query_df

   country_count
0            240

Let's take a look at our original table again.

In [24]:
sql_query_df = pd.read_sql("""

SELECT * 
FROM airports
LIMIT 5

""", con)

sql_query_df

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

Get maximum altitude in dataset along with corresponding airport.

In [25]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
    MAX(altitude) AS "Altitude (ft)"      
FROM airports

""", con)

sql_query_df

     Airport Name Altitude (ft)
0  Dauphin Barker           999

Something is wrong here. Make sure that your column is the right datatype for the function to avoid unexpected results.

In [26]:
%%bash
sqlite3 data/flights.db
.schema airports

Couldn't find program: 'bash'

#### `CAST()`

- can enforce typing on a given field.

In [27]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       MAX(CAST(altitude as float)) AS "Altitude (ft)"
       
FROM airports

""", con)

sql_query_df

      Airport Name  Altitude (ft)
0  Yading Daocheng        14472.0

Let's get the average altitude:

In [28]:
sql_query_df = pd.read_sql("""

SELECT AVG(CAST(altitude as int)) AS "Average Altitude (ft)"
FROM airports

""", con)

sql_query_df

   Average Altitude (ft)
0             933.449365

#### Exercise


Which country has the northern-most airport? 

> _Hint: Look for the highest latitude_

In [71]:
sqlme.sel('airports', 'country, code, latitude', 'latitude = (SELECT MAX(LATITUDE) FROM airports)')
df = sqlme.sel('airports', '*')
df[df['latitude'].astype(dtype='float64')==df['latitude'].astype(dtype='float64').max()]

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
85,85,86,Alert,Alert,Canada,YLT,CYLT,82.517778,-62.280556,100,-5,A,America/Toronto

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""
            
SELECT name AS airport_name, country, MAX(CAST(latitude as int))
FROM airports


""", con)

```
</details>

So far:
- Selecting fields (columns) and computing functions of them.

Want to: 
- Select records (rows) matching particular criteria.

#### WHERE: Selecting rows via filtering

SELECT columns
<br>
FROM table
<br>
WHERE filter_column meets condition

#### Filtering by comparison: WHERE statement

Commonly filter by how column compares to a value.

SELECT column1, column2 
FROM table
WHERE column2 > number

| Operator | Meaning | 
| --- | --- |
| \= | equal |
| \<> | not equal |
| \<  |  less than |
| \> | greater than |
| \<=  | less than or equal to |
| \>= | greater than or equal to |

**Example**

Get a airport, their name, city and country for which the airport's altitude is less than sea level.

In [ ]:
sql_query_df = pd.read_sql("""
SELECT name, city, country,
CAST(altitude AS int) AS altit

FROM airports

WHERE altit < 0


""", con)

sql_query_df

#### NOT operator
- Before conditional in `WHERE` clause.
- Negates conditional.

In [ ]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS int) AS "Airport Latitude",
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

WHERE NOT "Altitude (ft)" <= 12500

""", con)

sql_query_df

#### Chaining conditionals for filtering
- AND
- OR

#### AND
Get all airports with:
- Altitude > 12500 ft.
- Latitude > 30 degrees

In [ ]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS int) AS "Airport Latitude",
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

WHERE "Altitude (ft)" > 12500 AND "Airport Latitude" > 30

""", con)

sql_query_df

#### OR
Get all airports and their latitude/longitude in Iceland and Denmark.

In [ ]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS int) AS "Latitude",
       CAST(longitude AS int) AS "Longitude"
       
FROM airports

WHERE country = "Iceland" OR country = "Denmark"

""", con)

sql_query_df.head(12)

#### Exercise

Get the name, lat/long, and altitude for the airport with the maximum altitude considering only airports in Chile and Argentina.

In [98]:
sqlme.sel('airports', 'name,\nCAST(latitude as int) AS lat, \nCAST(longitude as int) AS long, \nCAST(altitude as int) AS alti', "country = 'Chile' OR 'Argentina'", order='alti DESC', limit='1')

                           name  lat  long  alti
0  San Pedro de Atacama Airport  -22   -68  7959

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
sql_query_df = pd.read_sql("""

SELECT name AS airport_name,
    CAST(latitude as float) AS latitude,
    CAST(longitude as float) AS longitude,
    MAX(CAST(altitude as int)) AS altitude
    
    FROM airports
    
    WHERE country = "Chile" OR country = "Argentina"
    

""", con)

sql_query_df

```
</details>

#### BETWEEN

- Writing multiple inequalities for selecting ranges with `WHERE` statement: annoying.

- BETWEEN ... AND ... solves this problem.

#### Example 
Get the airport name, country, latitude, and longitude where latitude is between 48 and 51.

In [ ]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS int) AS "Latitude",
       CAST(longitude AS int) AS "Longitude"
       
FROM airports

WHERE Latitude BETWEEN 48 AND 51
""", con)

sql_query_df

 #### Exercise
Get the name, lat/long, and altitude for the airports with altitude between 0 and 2000 ft considering only airports in Chile and Argentina.

In [78]:
sqlme.sel('airports', 'name, latitude, longitude,\nCAST(altitude as int) AS alt', 'country = "Chile" OR "Argentina"\n AND alt BETWEEN 0 AND 2000')

                                   name    latitude    longitude   alt
0                            Chacalluta  -18.348531   -70.338742   167
1                             Balmaceda  -45.916058   -71.689475  1722
2                             El Bosque    -33.5618     -70.6884  1844
3                           Chile Chico  -46.583341   -71.687405  1070
4                                El Loa  -22.498175   -68.903575  7543
5            General Bernardo O Higgins  -36.582497   -72.031367   495
6          Carlos Ibanez Del Campo Intl  -53.002642   -70.854586   139
7                        Teniente Vidal  -45.594211   -72.106133  1020
8                    Diego Aracena Intl  -20.535222   -70.181275   155
9            Arturo Merino Benitez Intl  -33.392975   -70.785803  1555
10                    Cerro Moreno Intl  -23.444478     -70.4451   455
11             Capitan Fuentes Martinez    -53.2537   -70.319228   104
12                            Futaleufu  -43.189167   -71.851112  1148
13                        Maria Dolores  -37.401731   -72.425444   374
14                Guardiamarina Zanartu  -54.931072   -67.626261    88
15                     Carriel Sur Intl   -36.77265   -73.063106    26
16                        Mataveri Intl  -27.164792  -109.421831   227
17       Canal Bajo Carlos Hott Siebert  -40.611208   -73.061042   187
18                             Vallenar  -28.596403   -70.755997  1725
19                  De La Independencia  -34.173694   -70.775694  1446
20                           La Florida  -29.916233   -71.199522   481
21                      Eulogio Sanchez  -33.456278   -70.546667  2129
22                             Maquehue  -38.766819   -72.637097   304
23                       El Tepual Intl  -41.438886   -73.093953   294
24                              Chaiten  -42.932808   -72.699114    13
25                               Pichoy  -39.649956   -73.086111    59
26                              Copiapo         -27          -70  1000
27                        Pucón Airport    -39.2928     -71.9159   853
28        Ricardo García Posada Airport    -26.3111     -69.7652  5240
29                       Puerto Natales  -51.733333   -72.516667     9
30  Aeropuerto Capitan Fuentes Martinez    -53.2537   -70.319228   104
31                         Vina Del Mar  -32.949611   -71.478583   461
32        Guardiamarina Zanartu Airport    -54.9311     -67.6263    88
33                       General Freire    -34.9667     -71.2164   722
34                       Isla San Felix  -26.293864   -80.096214   165
35              Robinson Crusoe Airport  -33.665001   -78.929703   433
36                      Caldera Airport  -27.078052   -70.795305   180
37         San Pedro de Atacama Airport  -22.918888   -68.162777  7959


<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python
sql_query_df = pd.read_sql("""

SELECT name, country,
CAST(latitude as float) AS latit,
CAST(longitude as float) AS longit,
CAST(altitude as int) AS altit

FROM airports

WHERE ( (country == 'Chile') OR (country == 'Argentina') )
AND 
altit BETWEEN 0 AND 2000


""", con)

sql_query_df

```
</details>

#### IN / NOT IN

- Get all records with a given field taking on a set of values.

SELECT col1, col2 <br> 
FROM table <br>
WHERE col1 IN (col_value1, col_value2, ...) <br>

#### Example

Get name, latitude, longitude for airports in Brazil, Argentina, Chile, and Uruguay

In [ ]:

sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS int) AS "Latitude",
       CAST(longitude AS int) AS "Longitude"
       
FROM airports

WHERE country IN ("Argentina", "Brazil", "Chile", "Uruguay")
""", con)

sql_query_df

##### Filtering rows with null (or no null) values in `WHERE` statement
- IS NULL
- IS NOT NULL

The `IS` operator:
- necessary when working with `NULL` values 
- Cannot use = or <> operators here.

In [ ]:
pd.read_sql("""

SELECT name AS "Airport Name",
       code AS "Airport Code"
       
FROM airports

WHERE "Airport Code" IS NULL

""", con)

#### Exercise:

Get the count of records with nulls in the code column of the airport table

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT COUNT(*)
FROM airports
WHERE code IS NULL

""", con)
```
</details>

#### ORDER BY: Sorting Results

Use `ORDER BY` to identify the column(s) you want to sort on:
- `ASC` for ascending order (default)
- `DESC` for descending order

Get the name and code of airports with:
- top 10 highest altitudes.
- in order of decreasing altitude. 

Then get lowest 10 in increasing order.

In [ ]:
pd.read_sql("""

SELECT name AS "Airport Name", 
       code,
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

ORDER BY "Altitude (ft)" DESC

LIMIT 10
         
""", con)

Ordering on multiple columns:

- Can order on one column first and then on another.

#### Example
Order by:
- decreasing latitudes
- increasing longitudes
- Altitude > 10000 ft.

In [ ]:
pd.read_sql("""

SELECT name AS "Airport Name",
       CAST(altitude AS int) AS "Altitude (ft)",
       CAST(latitude AS int) AS "Airport Latitude",
       CAST(longitude AS int) AS "Airport Longitude"    
FROM airports
WHERE "Altitude (ft)" > 10000
ORDER BY "Airport Latitude" DESC, "Airport Longitude" 

""", con)

#### CASE WHEN STATEMENTS
Use `CASE` to create new columns using conditional logic:

E.g. partition altitudes into high, medium and low.

In [ ]:
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(altitude AS int) AS "Altitude (ft)",
       CASE 
            WHEN CAST(altitude AS int) > 1000 THEN "High"
            WHEN CAST(altitude AS int) < 100 THEN "Low"
            ELSE "Moderate"
       END AS "Altitude Category"
       
FROM airports
         
LIMIT 20

""", con)

sql_query

# Exercises

## Country List

Create a list of countries with airports and order them alphabetically A-Z.

> _Hint: You will need to remove duplicates._

In [46]:
sqlme.sel('airports', 'country', order="country ASC").drop_duplicates()

             country
0        Afghanistan
21           Albania
22           Algeria
66    American Samoa
69            Angola
...              ...
8063       West Bank
8064  Western Sahara
8067           Yemen
8078          Zambia
8091        Zimbabwe

[240 rows x 1 columns]

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT DISTINCT country
FROM airports
ORDER BY country ASC

""", con)
```
</details>

## Southern Airports

Get the name, country and latitude of the 10 southern-most airports. 

> _Hint: Look for the smallest latitude._

In [99]:
sqlme.sel("airports", "name, country, CAST(latitude as float) AS lat", order='lat ASC', limit="10")

                            name         country        lat
0             South Pole Station      Antarctica -89.999997
1  McMurdo Station Pegasus Field      Antarctica -77.963333
2                Mcmurdo Station      Antarctica -77.867358
3    Ice Runway-McMurdo Sstation      Antarctica -77.847778
4                 South Shetland      Antarctica -68.000000
5       Rothera Research Station  United Kingdom -67.340000
6                 Wilkins Runway      Antarctica -66.689444
7                     Antarctica      Antarctica -66.000000
8                     Antarctica      Antarctica -66.000000
9                    Neko Harbor      Antarctica -64.500000

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT name, country, CAST(latitude AS int) AS "Airport Latitude"
FROM airports
ORDER BY "Airport Latitude" ASC
LIMIT 10

""", con)
``` 
</details>

## Active UK Airlines

Create a list of active airlines in the United Kingdom from the airlines table. 

> _Hint: You will need to explore the airlines table to figure out how to do this._

In [107]:
sqlme.sel('airlines', 'DISTINCT *', 'country = "United Kingdom"\nAND active="Y"')

,index,id,name,alias,iata,icao,callsign,country,active
0,111,112,Astraeus,\N,5W,AEU,FLYSTAR,United Kingdom,Y
1,491,492,Air Southwest,\N,None,WOW,SWALLOW,United Kingdom,Y
2,507,508,Aurigny Air Services,\N,GR,AUR,AYLINE,United Kingdom,Y
3,564,565,Air Wales,\N,6G,AWW,RED DRAGON,United Kingdom,Y
4,664,665,AD Aviation,\N,None,VUE,FLIGHTVUE,United Kingdom,Y
5,689,690,Air Foyle,\N,GS,UPA,FOYLE,United Kingdom,Y
6,1353,1355,British Airways,\N,BA,BAW,SPEEDBIRD,United Kingdom,Y
7,1409,1411,British International Helicopters,\N,BS,BIH,BRINTEL,United Kingdom,Y
8,1435,1437,bmi,bmi British Midland,BD,BMA,MIDLAND,United Kingdom,Y
9,1439,1441,bmibaby,\N,WW,BMI,BABY,United Kingdom,Y
10,1443,1445,British Midland Regional,\N,None,BMR,None,United Kingdom,Y
11,1541,1543,British Mediterranean Airways,\N,KJ,LAJ,BEE MED,United Kingdom,Y
12,1793,1795,BA CityFlyer,\N,CJ,CFE,FLYER,United Kingdom,Y
13,1921,1923,Crest Aviation,\N,None,CAN,CREST,United Kingdom,Y
14,2115,2117,Eastern Airways,\N,T3,EZE,EASTFLIGHT,United Kingdom,Y
15,2262,2264,Excel Airways,\N,JN,XLA,EXPO,United Kingdom,Y
16,2263,2265,Excel Charter,\N,None,XEL,HELI EXCEL,United Kingdom,Y
17,2295,2297,easyJet,EasyJet Airline,U2,EZY,EASY,United Kingdom,Y
18,2355,2357,First Choice Airways,\N,DP,FCA,JETSET,United Kingdom,Y
19,2393,2395,Flightline,\N,B5,FLT,FLIGHTLINE,United Kingdom,Y
20,2419,2421,Flybe,\N,BE,BEE,JERSEY,United Kingdom,Y
21,2423,2425,Flyglobespan,\N,B4,GSM,GLOBESPAN,United Kingdom,Y
22,2484,2486,GB Airways,\N,GT,GBL,GEEBEE AIRWAYS,United Kingdom,Y
23,2758,2761,Highland Airways,\N,None,HWY,HIWAY,United Kingdom,Y
24,3023,3026,Jet2.com,\N,LS,EXS,CHANNEX,United Kingdom,Y
25,3526,3532,Monarch Airlines,\N,ZB,MON,MONARCH,United Kingdom,Y
26,3562,3568,MyTravel Airways,\N,VZ,MYT,KESTREL,United Kingdom,Y
27,3678,3684,Norfolk County Flight College,\N,None,NCF,COUNTY,United Kingdom,Y
28,4106,4113,Kinloss Flying Training Unit,\N,None,KIN,KINLOSS,United Kingdom,Y
29,4314,4323,ScotAirways,\N,None,SAY,SUCKLING,United Kingdom,Y
30,4886,4897,Thomas Cook Airlines,\N,MT,TCX,KESTREL,United Kingdom,Y
31,5002,5013,Thomsonfly,\N,BY,TOM,TOMSON,United Kingdom,Y
32,5329,5347,Virgin Atlantic Airways,\N,VS,VIR,VIRGIN,United Kingdom,Y
33,5589,10642,Jc royal.britannica,None,None,JRB,None,United Kingdom,Y
34,5724,13936,Royal European Airlines,None,69,\N,None,United Kingdom,Y
35,5782,16261,CB Airways UK ( Interliging Flights ),None,1F,CIF,None,United Kingdom,Y
36,5848,16881,Air Cudlua,Air Cudlua,None,CUD,Cudlua,United Kingdom,Y
37,6010,19525,BBN-Airways,BlackBurn,None,EGH,BBN,United Kingdom,Y
38,6022,19677,Rainbow Air Euro,Rainbow Air EU,RU,RUE,Rainbow Air,United Kingdom,Y
39,6034,19808,All Europe,All Europe,N9,N99,None,United Kingdom,Y

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT name
FROM airlines
WHERE active='Y'
AND country='United Kingdom'

""", con)
```
</details>

**Exercise**

- Partition the airports into three latitude regions: 

- northern (>= 30), central (30,-30), and southern zones (<=-30).

Get me all the airports in the central and southern zones:
- whose altitude is greater than 3000 ft.
- and anywhere but in Brazil, Venezuela, Papua New Guinea, South Africa and Madagascar

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", country,
       CAST(altitude AS int) AS "Altitude (ft)",
       CAST(latitude AS float) AS "Latitude (deg)",
       CASE 
            WHEN CAST(latitude AS float) >= 30 THEN "Northern"
            WHEN CAST(latitude AS float) <= -30 THEN "Southern"
            ELSE "Central"
       END lat_category
       
FROM airports

WHERE "Altitude (ft)" > 3000
AND
lat_category IN ("Central", "Southern")
AND
country NOT IN ("Brazil", "Venezuela", "Papua New Guinea", "South Africa", "Madagascar")


""", con)

sql_query
```
</details>